#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-rq8idMZQrMkL5iyK

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_droplet.main: Refreshing state... [id=196151282]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
aws_security_group.allow_inbound_ssh: Refreshing state... [id=sg-0735bd8de7ebd28ec]
aws_key_pair.personal: Refreshing state... [id=personal]
aws_vpc.main: Refreshing state... [id=vpc-0840b0733c96900ff]
digitalocean_record.root: Refreshing state... [id=126395676]
digitalocean_record.starling-webhooks: Refreshing state... [id=309351439]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
digitalocean_record.starling-listener: Refreshing state... [id=309272946]
digitalocean_record.opentracker: Refreshing state... [id=161872068]
aws_internet_gateway.main: Refreshing state... [id=igw-024403a7777ad7eed]
aws_subnet.main: Refreshing state... [id=subnet-07b920fcb5af96614]
aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-2666256247]
aws_instance.main: Refreshing state... [id=i-00e1c97632b63217f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.main will be updated in-place
  ~ resource "aws_instance" "main" {
        id                                   = "i-00e1c97632b63217f"
        tags                                 = {}
      ~ vpc_security_group_ids               = [
          - "sg-0735bd8de7ebd28ec",
        ] -> (known after apply)
        # (27 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_security_group.allow_inbound_ssh will be destroyed
  # (because aws_security_group.allow_inbound_ssh is not in configuration)
  - resource "aws_security_group" "allow_inbound_ssh" {
      - arn                    = "arn:aws:ec2:eu-west-1:558855412466:security-group/sg-0735bd8de7ebd28ec" -> null
      - description            = "Allow inbound SSH to an instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0735bd8de7ebd28ec" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "inbound-ssh" -> null
      - owner_id               = "558855412466" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0840b0733c96900ff" -> null
    }

  # aws_security_group.allow_ssh will be created
  + resource "aws_security_group" "allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow inbound SSH to an instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "inbound-ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0840b0733c96900ff"
    }

  # aws_security_group_rule.allow_all_outbound will be created
  + resource "aws_security_group_rule" "allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_inbound_ssh must be replaced
-/+ resource "aws_security_group_rule" "allow_inbound_ssh" {
      ~ id                       = "sgrule-2666256247" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0735bd8de7ebd28ec" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.


```

</details>